driver-tests/bpelse/exit/ExitBpel/src/ExitWithTH/IOWSDL1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="IOWSDL1" targetNamespace="http://j2ee.netbeans.org/wsdl/IOWSDL1"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://j2ee.netbeans.org/wsdl/IOWSDL1">
    <types/>
    <message name="IOWSDL1OperationRequest">
        <part name="InputPart" type="xsd:string"/>
    </message>
    <message name="IOWSDL1OperationReply">
        <part name="OutputPart" type="xsd:string"/>
    </message>
    <portType name="IOWSDL1PortType">
        <wsdl:operation name="IOWSDL1Operation">
            <wsdl:input name="input1" message="tns:IOWSDL1OperationRequest"/>
            <wsdl:output name="output1" message="tns:IOWSDL1OperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="IOWSDL1Binding" type="tns:IOWSDL1PortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="IOWSDL1Operation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/IOWSDL1"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/IOWSDL1"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="IOWSDL1Service">
        <wsdl:port name="IOWSDL1Port" binding="tns:IOWSDL1Binding">
            <soap:address location="http://localhost:${HttpDefaultPort}/TermainationHandlerBpel/ExitWithTH/IOWSDL1Service/IOWSDL1Port"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="IOWSDL1Plink">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="IOWSDL1PortTypeRole" portType="tns:IOWSDL1PortType"/>
    </plnk:partnerLinkType>
</definitions>
