driver-tests/bpelse/TerminationHandler/TerminationHandlerJbi/test/ExplicitTH_NormalActivity/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iow="http://j2ee.netbeans.org/wsdl/IOWSDL1">
  <soapenv:Body>
    <iow:IOWSDL1Operation>
      <InputPart>Test3</InputPart>
    </iow:IOWSDL1Operation>
  </soapenv:Body>
</soapenv:Envelope>